examples/fluid-fluid/top-fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



convertToMeters 1;

vertices
(

    (0 .5 0)
    (1 .5 0)
    (1 1 0)
    (0 1 0)
    
    (0 .5 .4)
    (1 .5 .4)
    (1 1 .4)
    (0 1 .4)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 100 1) simpleGrading (5 10 1)
);

edges
(
);

boundary
(

    inlet
    {
        type wall;
        faces
        (
        	(0 4 7 3)
        );
    }
    
    outlet
    {
        type wall;
        faces
        (
        	(1 2 6 5)
        );
    }
    
    top
    {
        type wall;
        faces
        (
        	(7 6 2 3)
        );
    }
    
    interface
    {
    	type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion	fluid-1;
        samplePatch		interface;
        faces
        (
        	(4 0 1 5)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
